Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * Quadrature counts one physical click of this knob produces.
 *
 * attachFullQuad() counts all four edges of a quadrature cycle, and the
 * obvious reading is that a detent spans all four. On this board it spans two.
 * The BOM names the part only as "ENCODER1" and there is no datasheet, so this
 * is a hardware measurement, not a derivation: the sibling pager firmware for
 * this same T-Embed CC1101 checked it on the device — 27 consecutive selection
 * moves, none skipped, a raw delta of exactly 2 for the majority — and records
 * that four would move the selection two rows per click.
 *
 * Which is exactly the symptom this replaces: at 4, half of every click was
 * left in the accumulator and the highlight moved on every second detent.
 *
 * Changing this is a hardware claim and has to be re-checked on a board. The
 * Info screen shows the raw count for that purpose.
 */
#define UI_COUNTS_PER_DETENT 2

/*
 * Which way the count runs against the direction a hand calls "down the list".
 * The counter runs the other way round on this board, so the delta is negated
 * once, here, rather than by flipping the A/B pins in ui_init() — swapping
 * those would also invert the raw count the Info screen reports.
 */
#define UI_ENCODER_DIRECTION (-1)
#define UI_DEBOUNCE_MS       30
#define UI_IDLE_MS           15000
/* Live screens (blast, AP, info) repaint at this rate; the fields are all
   change-detected, so this bounds the work rather than causing it. */
#define UI_TICK_MS           250
/* How long the finished/stopped result stays up before the menu comes back. */
#define UI_RESULT_MS         1500

static ESP32Encoder ui_encoder;

/*
 * Detents and buttons are tracked by two state machines that share nothing.
 * The sibling pager firmware lost its detents whenever the button was held,
 * because the two were entangled: the accumulator's baseline advanced on a
 * pass whose delta the button branch had already discarded, so movement
 * during a hold evaporated. The invariant that prevents it here is that every
 * count read out of the hardware is folded into ui_enc_accum, and the only
 * other writer is ui_encoder_reset() — which re-baselines onto the current
 * hardware count, so it cannot lose a count either. In particular UiButton
 * writes neither, and no button state can skip the fold.
 */
static int64_t ui_enc_raw = 0;   /* last hardware count seen */
static int32_t ui_enc_accum = 0; /* counts not yet worth a detent, sign-carrying */

/* Detents since the last call: positive one way round the knob, negative the
   other. The accumulator carries the remainder in both directions, so half a
   detent forwards followed by half a detent back nets out to nothing instead
   of stepping twice. */
static int ui_encoder_steps() {
    int64_t raw = ui_encoder.getCount();
    ui_enc_accum += (int32_t)(raw - ui_enc_raw);
    ui_enc_raw = raw;

    int steps = 0;
    while (ui_enc_accum >= UI_COUNTS_PER_DETENT) {
        ui_enc_accum -= UI_COUNTS_PER_DETENT;
        steps++;
    }
    while (ui_enc_accum <= -UI_COUNTS_PER_DETENT) {
        ui_enc_accum += UI_COUNTS_PER_DETENT;
        steps--;
    }
    return steps * UI_ENCODER_DIRECTION;
}

/*
 * Re-baseline onto the current hardware count and drop the partial detent.
 *
 * Called on every screen transition. Carrying a remainder is right within a
 * screen — half a click forwards then half back should net out — but across a
 * transition it is a click the user spent somewhere else, and letting it land
 * on the new screen is a selection that moves on its own before the knob is
 * touched. Note this only ever discards less than one detent: a whole one has
 * already been returned to the caller.
 */
static void ui_encoder_reset() {
    ui_enc_raw = ui_encoder.getCount();
    ui_enc_accum = 0;
}

/* Active-low button with a settling filter. A click is a completed
   press-then-release, not a level: holding the key must not repeat, and the
   user key's 3s hold gesture must not also read as a click. */
struct UiButton {
    uint8_t pin;
    bool raw;                  /* last sample, pressed = true */
    bool level;                /* debounced state */
    unsigned long changed_at;  /* when raw last differed */
    unsigned long pressed_at;
    unsigned long held_ms;     /* how long the click just reported was held */
    bool click;                /* one pass only */
};

static UiButton ui_enc_key  = {PIN_ENC_KEY,  false, false, 0, 0, 0, false};
static UiButton ui_user_key = {PIN_USER_KEY, false, false, 0, 0, 0, false};

static void ui_button_poll(UiButton &b) {
    b.click = false;
    bool raw = (digitalRead(b.pin) == LOW);
    if (raw != b.raw) {
        b.raw = raw;
        b.changed_at = millis();
        return;
    }
    if (millis() - b.changed_at < UI_DEBOUNCE_MS) return;
    if (raw == b.level) return;

    b.level = raw;
    if (raw) {
        b.pressed_at = millis();
    } else {
        b.held_ms = millis() - b.pressed_at;
        b.click = true;
    }
}

/* ===== Screens ===== */

enum {
    UI_CLOCK = 0,
    UI_MENU,
    UI_MSGLIST,
    UI_MSGCARD,
    UI_TVMENU,
    UI_BRAND,
    UI_BLAST,
    UI_AP,
    UI_INFO,
    /* Appended at the END, and anything added later must be too: this enum and
       ui_titles[] below are parallel arrays, so a value inserted in the middle
       silently shifts every title after it onto the wrong screen. The assert
       below catches a missing entry; nothing can catch a reordering, which is
       why the rule is "append". */
    UI_REC
};

/* Capitals: this is the service text of the header bar, not prose. One entry
   per screen above, in the same order. */
static const char *ui_titles[] = {
    "", "MENU", "MESSAGES", "MESSAGES", "TV-B-GONE", "BY BRAND", "TV-B-GONE",
    "SETUP AP", "INFO", "RECORDING"
};

static_assert(sizeof(ui_titles) / sizeof(ui_titles[0]) == UI_REC + 1,
              "ui_titles[] must have one entry per screen, in enum order");

/* Top level. The marker on a selected row is also ">", so a submenu is spelled
   out with a trailing one rather than by a different marker. Messages leads
   because it is what this device is for; everything else is a tool it also
   happens to carry. */
enum {
    UI_ITEM_MSG = 0,
    UI_ITEM_QUIET,
    UI_ITEM_BACKLIGHT,
    UI_ITEM_DIM,
    UI_ITEM_TVBGONE,
    UI_ITEM_AP,
    UI_ITEM_INFO,
    UI_ITEM_BACK,
    UI_ITEM_COUNT
};

/* Quiet sits second, under Messages: it is the other thing this device does to
   messages, and it is the row somebody reaches for at one in the morning
   without wanting to read a menu first. The row's name is here; the hours after
   it come from ring_quiet_hours(), because they are the skill's to say — the
   same division as the Messages row and its unread count.

   Backlight sits third, next to Quiet, because the two are the settings a hand
   reaches for in the dark and both act in place rather than opening a screen.
   Same division again: the name is here, the level's word comes from
   bl_level_label().

   Auto-dim sits directly under Backlight because it decides what happens to
   the row above it: whether that level is what the panel holds, or only what
   it holds while somebody is there. Reading the two in that order is the whole
   explanation of the setting, which is why it is not filed under Info. */
static const char *ui_items[UI_ITEM_COUNT] = {
    "Messages >",   /* ui_list_label() appends the unread count */
    "Quiet",        /* ui_list_label() appends the ring's window, or "off" */
    "Backlight",    /* ui_list_label() appends the level's word, or its step */
    "Auto-dim",     /* ui_list_label() appends "on" or "off" */
    "TV-B-Gone >",
    "Setup AP",
    "Info",
    "Back"
};

