Awis13/seed/seeds/esp32-tembed/src/ui.h
/* TV-B-Gone. The three blasts are the three regions POST /ir/tvbgone takes;
   By brand opens the named codes. */
enum {
    UI_TV_ALL = 0,
    UI_TV_NA,
    UI_TV_EU,
    UI_TV_BRAND,
    UI_TV_BACK,
    UI_TV_COUNT
};

static const char *ui_tv_items[UI_TV_COUNT] = {
    "Blast all",
    "Blast NA",
    "Blast EU",
    "By brand >",
    "Back"
};

static uint8_t ui_screen = UI_CLOCK;
static int ui_sel = 0;
static int ui_sel_drawn = -1;
/* First list entry on screen: the by-brand list is longer than the panel. */
static int ui_first = 0;
static unsigned long ui_last_input = 0;
static unsigned long ui_last_draw = 0;

/*
 * Somebody is at the device. The one place ui_last_input is written, so that
 * "what counts as input" is a question with a list of callers rather than an
 * assignment scattered across two files.
 *
 * It matters more than it did before the panel could go dark. A screen timeout
 * that fires wrongly costs a trip back into a menu; a blank that fires wrongly
 * costs the owner the screen they are looking at, and every path that puts
 * something on the panel without going through here is a path that draws it
 * into the dark. main.cpp's ap_start() is one such path and calls this; that is
 * the reason it is a named function and not an assignment.
 */
static void ui_note_input() { ui_last_input = millis(); }
/* When the blast being watched stopped running, 0 while it still is. */
static unsigned long ui_blast_done_at = 0;
/* The same, for the recording screen: when the take ended, 0 while it runs. */
static unsigned long ui_rec_done_at = 0;
/* False when the menu could not start a blast and none was already running. */
static bool ui_blast_ok = true;
/* The list the blast was started from, so that finishing goes back to it. */
static uint8_t ui_blast_back = UI_TVMENU;
static int ui_blast_back_sel = 0;

/* Which notification the card is showing. An id, not an index: the list can
   shift underneath it when something expires or a new message arrives. */
static uint32_t ui_msg_id = 0;
/* Fade frames already drawn for the card in front, MSG_FADE_STEPS once done. */
static uint8_t ui_card_fade = 0;
/* Which reply chip the knob is on, for the card in front. Its own variable and
   deliberately not ui_sel: ui_sel is the row in the message list this card was
   opened from, and the card hands it straight back on the way out — a second
   meaning on it would move the list under the user. Meaningless on a message
   that carries no options, which is every message that never gets here. */
static int ui_chip_sel = 0;
/* Scroll window the message list was last drawn with, so that a window that
   moved is recognised as needing the same full repaint a moved selection does. */
static int ui_first_drawn = -1;

#define UI_MENU_Y0   30
#define UI_MENU_DY   32
/* Rows of font 4 at that pitch that fit above the bottom of a 170px panel. */
#define UI_MENU_ROWS 4
#define UI_ROW_COUNT 8

/*
 * Message list geometry. Font 2 rows on a rigid three-column grid, five of
 * them under an 18px header bar: bars at y-4 for 24px, pitch 28, so the last
 * one ends at 156 on a 170px panel.
 *
 * Every column width below is a budget the renderer ellipsises into, and each
 * was checked against TFT_eSPI's own width tables rather than by eye. In font
 * 2 the widest glyph is 10px ('M' and 'W'), so the guaranteed worst case is 7
 * characters of source, 16 of title and 4 of age — and the measured strings
 * that actually appear are well inside that: "! HOME-RIG" is 69px of the 76
 * the source column has, and the longest age "59m" is 24px of 46.
 */
#define MSG_ROWS      5
#define MSG_ROW_Y0    24
#define MSG_ROW_DY    28
#define MSG_BAR_X      6
#define MSG_BAR_W    308
#define MSG_BAR_UP     4   /* bar top, above the row's text origin */
#define MSG_BAR_H     24
#define MSG_SRC_X     10
#define MSG_SRC_W     76
#define MSG_TITLE_X   92
#define MSG_TITLE_W  160
#define MSG_AGE_R    310   /* right-aligned to this edge */
#define MSG_AGE_W     46

/*
 * Card geometry. 300x100 at (8,28), leaving the header bar above and a hint
 * line below at 140. Text is inset 14px from the left so it clears the 3px
 * accent bar, and 10px from the right, which gives the title 276px — 11
 * characters at the widest glyph font 4 has, and around 18 of ordinary mixed
 * case. The body gets two lines of the same 276px, 27 characters worst case in
 * font 2 and around 34 in practice.
 */
#define MSG_CARD_X     8
#define MSG_CARD_Y    28
#define MSG_CARD_W   300
#define MSG_CARD_H   100
#define MSG_PAD_L     14
#define MSG_PAD_R     10
#define MSG_ACCENT_W   3
/* Offset of each card peeking out behind. Named MSG_CARD_PEEK rather than the
   obvious MSG_PEEK because lwIP's <sys/socket.h> already owns that name — it
   arrived in this translation unit the day skills/voice.cpp started including
   esp_http_client.h, and the firmware is one translation unit, so a UI layout
   constant and a socket recv() flag were suddenly the same macro. */
#define MSG_CARD_PEEK  3
#define MSG_HINT_Y   140
/* The band under the card is one padded field the width of the card itself.
   The padding is the erase: TFT_eSPI back-fills it with the background, so a
   string that changes length — and the chip row changes length whenever it is
   answered — leaves nothing of the previous one behind. Narrowing this is what
   would produce ghosting, so it is a budget the chip row is fitted into rather
   than a number to tune. */
#define MSG_HINT_W   300

/* Arrival: three frames of rising blend plus a few pixels of upward travel.
   40ms a frame, so the whole thing is over in 120ms — present enough to read
   as an arrival, short enough that it never delays the first look. */
#define MSG_FADE_STEPS 3
#define MSG_FADE_MS   40
#define MSG_TINT_A    26   /* card fill: level colour at ~10% over black */
#define MSG_BORDER_A 102   /* card border: the same colour at ~40% */

/* One cache line per drawn row, shared by every screen in this file: only one
   of them is on screen at a time, and entering any screen wipes the panel and
   raises display_force, which makes draw_field ignore whatever the previous
   screen left in here. Wide enough for an ellipsised font 4 title, which is
   the longest string any of them draws. */
static char ui_row[UI_ROW_COUNT][48];

/* The message list needs its own cache: three cells per row, and it is the one
   screen whose rows are not a single string. Each cell is wide enough for the
   longest string its column can ever be asked to draw — an ellipsised title —
   so that the cache always holds the whole of what is on the panel and two
   different rows can never compare equal. */
#define MSG_CELL_LEN (NOTIFY_TITLE_LEN + 4)
static char ui_msg_cell[MSG_ROWS][3][MSG_CELL_LEN];

