Awis13/seed/seeds/esp32-tembed/src/ui.h
/* The card's two body lines get their own, wider cache. A body is 96
   characters and the panel is 276px, which at the narrowest glyphs font 2 has
   (3px, the punctuation) is more characters than fit in a row cache line. The
   pixel budget is the bound that matters; the buffer must not be a second,
   quieter one that cuts a line the display could have shown. */
static char ui_card_body[2][NOTIFY_BODY_LEN + 4];

static void ui_draw_row(int i, const char *text, int32_t y, uint8_t font,
                        uint16_t color) {
    draw_field(ui_row[i], sizeof(ui_row[i]), text, 12, y, font, color,
               TL_DATUM, 296);
}

/* ===== Fitting text to a column =====
 *
 * Columns are pixel budgets, and what goes in them is whatever an agent put in
 * the JSON. Everything below measures with TFT_eSPI's own tables — the same
 * ones textWidth() reads — so a string is cut where it actually stops fitting
 * rather than at a character count guessed from an average glyph.
 *
 * The fitting helpers and the chip row further down are compiled verbatim on
 * the host by tools/test_chips.sh. Keep every marker line self-closed and on a
 * line of its own, and keep every comment inside a marked region fully closed:
 * the slicer copies from the marker without understanding what it copies.
 */

/* host-test:begin fit — sliced out by tools/test_chips.sh */
static int ui_char_w(char c, uint8_t font) {
    char s[2] = {c, '\0'};
    return tft.textWidth(s, font);
}

/* Copy `src` into `dst`, cut to `max_px` with a trailing ellipsis if it does
   not fit. A column too narrow for the ellipsis itself is hard-truncated
   instead — three dots and nothing else says less than two real characters. */
static void ui_ellipsis(char *dst, size_t n, const char *src, uint8_t font,
                        int max_px) {
    if (n == 0) return;
    dst[0] = '\0';
    if (!src) return;
    if (tft.textWidth(src, font) <= max_px) {
        /* Copied a character at a time rather than with snprintf("%s"): the
           destination is a cache line sized for the widest thing this column
           can display, and spelling the bound out here is what keeps it from
           becoming a second, silent limit the compiler has to warn about. */
        size_t i = 0;
        while (src[i] && i + 1 < n) { dst[i] = src[i]; i++; }
        dst[i] = '\0';
        return;
    }

    int ell = tft.textWidth("...", font);
    bool with_ellipsis = (ell < max_px);
    int budget = with_ellipsis ? max_px - ell : max_px;

    size_t out = 0;
    int acc = 0;
    for (const char *p = src; *p && out + 4 < n; p++) {
        int cw = ui_char_w(*p, font);
        if (acc + cw > budget) break;
        acc += cw;
        dst[out++] = *p;
    }
    /* Hang the ellipsis off a word rather than off a gap. */
    while (out > 0 && dst[out - 1] == ' ') out--;
    dst[out] = '\0';
    if (with_ellipsis) snprintf(dst + out, n - out, "...");
}
/* host-test:end */

/* Break `src` over two lines of `max_px`, on a space where there is one. The
   second line carries the ellipsis, so a body too long for the card ends
   visibly rather than just stopping. */
static void ui_wrap2(const char *src, char *l1, size_t n1, char *l2, size_t n2,
                     uint8_t font, int max_px) {
    l1[0] = '\0';
    l2[0] = '\0';
    if (!src || !src[0]) return;
    if (tft.textWidth(src, font) <= max_px) {
        size_t i = 0;
        while (src[i] && i + 1 < n1) { l1[i] = src[i]; i++; }
        l1[i] = '\0';
        return;
    }

    int acc = 0, last_space = -1, i = 0;
    for (; src[i]; i++) {
        int cw = ui_char_w(src[i], font);
        if (acc + cw > max_px) break;
        if (src[i] == ' ') last_space = i;
        acc += cw;
    }
    /* A single word wider than the line has no space to break on: cut it. */
    int brk = (last_space > 0) ? last_space : i;

    size_t take = (size_t)brk;
    if (take >= n1) take = n1 - 1;
    memcpy(l1, src, take);
    l1[take] = '\0';

    const char *rest = src + brk;
    while (*rest == ' ') rest++;
    ui_ellipsis(l2, n2, rest, font, max_px);
}

/* Service text is capitals. Sources arrive as whatever an agent typed. */
/* host-test:begin fit — sliced out by tools/test_chips.sh */
static void ui_caps(char *dst, size_t n, const char *src) {
    size_t i = 0;
    for (; src && src[i] && i + 1 < n; i++) {
        char c = src[i];
        dst[i] = (c >= 'a' && c <= 'z') ? (char)(c - 'a' + 'A') : c;
    }
    dst[i] = '\0';
}
/* host-test:end */

/* ===== Reply chips =====
 *
 * A notification may carry up to four short labels, and the knob picks one of
 * them. They are drawn in the band under the card, in place of the hint that
 * band shows for a message with nothing to pick.
 *
 * The whole row is ONE string with marks in it, the way the menu draws its
 * selection: a step then costs one padded draw_field over the MSG_HINT_W band,
 * with no fillRect and no display_force, instead of four fields plus the
 * inverse bars an inverse-bar selection would need. The padding is what erases
 * the previous row — it is at least as wide as the widest row that can be
 * built here, which is the property the ellipsising below guarantees and the
 * one tools/test_chips.sh pins.
 */
/* host-test:begin chips — sliced out by tools/test_chips.sh */
/* One chip's text once it has been fitted: a label and its terminator are
   NOTIFY_OPT_LEN already, and the ellipsis can add three characters on top of
   15 kept whole — 19 bytes at worst. The fourth byte is spare rather than
   counted out to nothing, since the room costs one byte per chip. */
#define UI_CHIP_LEN     (NOTIFY_OPT_LEN + 4)
/* The whole row: every chip carries two wrapper characters, one of them also
   carries the answered mark, and the row carries a terminator. */
#define UI_CHIP_ROW_LEN (NOTIFY_OPT_MAX * (UI_CHIP_LEN + 2) + 2)
/* Two marks rather than one, because they answer two different questions —
   what a click would do, and what a click already did. A message can be
   answered again, which puts both marks on the same chip. */
#define UI_CHIP_OPEN    '['
#define UI_CHIP_CLOSE   ']'
#define UI_CHIP_ANSWER  '*'

