Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * Build the row: the labels, in the order they arrived, with the selected one
 * bracketed and the answered one starred.
 *
 * Every chip pays for both of its wrapper characters whether it is the selected
 * one or not. That gives the chips their gap without a separator that would
 * have to be counted separately, and it keeps the row's width the same
 * wherever the selection sits — exactly one chip is bracketed at a time — so
 * the band is sized once for the widest row a detent can produce. A bracket is
 * two pixels narrower than a space, so the labels either side of the selection
 * do shift by that much as it moves; holding them still would mean a field per
 * chip, four cached strings and four draw_field calls a step, for two pixels.
 *
 * `row_px` is the pixel budget the whole row has to fit in, and it is shared
 * out: each chip gets what is left after the wrappers and the one answered mark
 * are paid for. A label wider than its share is cut with the same trailing
 * ellipsis every other column on this device uses — 15 bytes of label can be
 * wider than a quarter of the row, and a chip that says "ROLLBA..." is a chip
 * you can still ask about, while one clipped mid-glyph is a smear.
 *
 * `sel` and `chosen` outside 0..count-1 simply mark nothing, which is what an
 * unanswered message (chosen = -1) needs and what a card nobody has turned the
 * knob on yet (sel = -1) needs: a row with no bracket anywhere on it says the
 * click would not answer, which on that card it does not. It is also what an
 * index arriving from the store or from a snapshot outside 0..count-1 gets,
 * rather than a read past the labels there are.
 */
static void ui_chip_row(char *dst, size_t n, const NotifyOptions &opts,
                        uint8_t count, int sel, int chosen, int row_px,
                        uint8_t font) {
    if (!dst || n == 0) return;
    dst[0] = '\0';
    if (count == 0) return;
    if (count > NOTIFY_OPT_MAX) count = NOTIFY_OPT_MAX;

    int wrap_px = 2 * ui_char_w(' ', font);
    int budget = (row_px - (int)count * wrap_px - ui_char_w(UI_CHIP_ANSWER, font))
                 / (int)count;
    if (budget < 1) budget = 1;

    size_t out = 0;
    for (int i = 0; i < (int)count; i++) {
        char caps[UI_CHIP_LEN], text[UI_CHIP_LEN];
        char mark[2] = { (i == chosen) ? UI_CHIP_ANSWER : '\0', '\0' };

        ui_caps(caps, sizeof(caps), opts.label[i]);
        ui_ellipsis(text, sizeof(text), caps, font, budget);

        int wrote = snprintf(dst + out, n - out, "%c%s%s%c",
                             (i == sel) ? UI_CHIP_OPEN : ' ', mark, text,
                             (i == sel) ? UI_CHIP_CLOSE : ' ');
        /* The caller's buffer is sized for the worst case this can build, so a
           short one is a mistake elsewhere: stop with whole chips in it rather
           than leave half a label and an unbalanced bracket on the panel. */
        if (wrote < 0 || (size_t)wrote >= n - out) {
            dst[out] = '\0';
            return;
        }
        out += (size_t)wrote;
    }
}

/*
 * One detent on the chip row. It wraps at both ends, the way every other list
 * on this device does, because the knob has no end stops.
 *
 * A negative `sel` is "nothing is selected yet", which is how a card opens
 * before anybody has turned the knob on it. The first detent then lands ON the
 * first chip instead of stepping past it, in either direction: there was no
 * position to step from, so the step is what makes one. Everything after that
 * is the ordinary walk.
 *
 * `sel` at or above `count` is a value that did not come from a previous detent
 * — a `chosen` read back out of the store or out of a snapshot, which is only
 * as trustworthy as the file it came from. It is clamped back into range rather
 * than trusted, and the click path steps by zero for exactly that clamp before
 * handing the value to notify_choose_id() as the answer.
 *
 * The reduction of `steps` is a guard rather than arithmetic the caller needs:
 * it keeps the addition below in range for any int, and no test claims it.
 */
static int ui_chip_step(int sel, int steps, uint8_t count) {
    if (count == 0) return 0;
    int n = (int)count;
    if (sel < 0) {
        sel = 0;
        if (steps > 0)      steps--;
        else if (steps < 0) steps++;
    }
    if (sel >= n) sel = n - 1;
    steps %= n;
    sel = (sel + steps) % n;
    if (sel < 0) sel += n;
    return sel;
}

/*
 * Where the knob sits the moment a card opens: on the answer the message
 * already carries, or on nothing at all.
 *
 * Nothing is the answer for a message nobody has replied to, and it is not a
 * detail of the drawing. A card can arrive in front of somebody who never asked
 * for it — ui_poll() opens one on arrival while the device sits on its clock —
 * and the click that comes next has meant "dismiss" on every firmware this
 * device has run. Starting the knob on a chip would file that reflex as a
 * deliberate answer, and by convention the first chip is the one that says yes.
 *
 * `chosen` is bounds-checked against the count rather than only tested for -1,
 * because it arrives from the store and a snapshot is only as trustworthy as
 * the file it came out of: an answer pointing past the labels that are there is
 * no answer, and starting the knob on it would let the click that leaves record
 * it as one.
 *
 * Its own function, rather than one line inside ui_enter_card(), only so that
 * the host suite can reach it — the caller needs the store, the screen state
 * and the encoder, and cannot be sliced. Same reason notify_take_id() is its
 * own function in notify.cpp.
 */
static int ui_chip_start(int chosen, uint8_t count) {
    if (chosen < 0 || chosen >= (int)count) return -1;
    return chosen;
}

/*
 * Does this click record an answer, or is it the plain acknowledge every other
 * card gets?
 *
 * It answers only when the message asks something AND the knob has been turned
 * to one of the chips. Both halves matter and they fail in opposite ways: with
 * no options there is nothing to record, and with options but no selection
 * there is nobody's decision to record — see ui_chip_start() for why a card
 * can be in front of somebody who never chose to open it.
 *
 * Extracted for the same reason as ui_chip_start(), and next to it because the
 * two are one rule in two halves: the click may only answer what an entry to
 * the card, or a detent since, actually selected.
 */
static bool ui_chip_answers(int sel, uint8_t count) {
    return count > 0 && sel >= 0;
}
/* host-test:end */

/* The chip row's own cache, sized by the region above rather than shared with
   ui_row[]: four 15-character labels and their marks are longer than a row
   line, and draw_field compares only the first cache_size-1 bytes — a cache
   shorter than what is on the panel lets two different rows compare equal and
   silently skips the repaint. */
static char ui_card_hint[UI_CHIP_ROW_LEN];

static uint16_t ui_level_color(uint8_t level) {
    switch (level) {
        case NOTIFY_CRIT: return COL_CRIT;
        case NOTIFY_WARN: return COL_ACCENT;
        default:          return COL_INFO;
    }
}

/* `MSG 03/12` in the header bar, black on amber, zero-padded so the field is
   the same width whatever it says. Shared by the list and the card, which are
   two views of one position in one queue. */
static void ui_draw_msg_counter(int pos, int total) {
    char buf[16];
    if (pos < 0) pos = 0;
    if (pos > 99) pos = 99;
    if (total < 0) total = 0;
    if (total > 99) total = 99;
    snprintf(buf, sizeof(buf), "MSG %02d/%02d", pos, total);
    draw_field(ui_row[UI_ROW_COUNT - 1], sizeof(ui_row[0]), buf,
               tft.width() - 8, HDR_Y, 2, COL_BG, TR_DATUM, 76, COL_ACCENT);
}

/* Shared scroll window: move it only when the selection would otherwise leave
   it, which keeps a step inside the window down to a two-row repaint. */
static void ui_window(int count, int rows) {
    if (ui_sel < ui_first) ui_first = ui_sel;
    if (ui_sel >= ui_first + rows) ui_first = ui_sel - rows + 1;
    if (ui_first > count - rows) ui_first = count - rows;
    if (ui_first < 0) ui_first = 0;
}

/* The three list screens differ only in what they list, so they share one
   renderer and one set of input rules. Both accessors read the live tables —
   the by-brand list is ir_codes[] itself, not a copy of the names. */
static int ui_list_count() {
    switch (ui_screen) {
        case UI_MENU:    return UI_ITEM_COUNT;
        case UI_TVMENU:  return UI_TV_COUNT;
        case UI_BRAND:   return ir_code_count + 1;  /* the codes, then Back */
        case UI_MSGLIST: return notify_count() + 1; /* the messages, then Back */
    }
    return 0;
}

static const char *ui_list_label(int i) {
    /* The Messages row carries its unread count and the Quiet row carries the
       window's hours, so those labels are built rather than looked up.
       ui_draw_list() consumes the return value into the row string before
       asking for the next one, so one shared buffer is enough. */
    static char built[24];

    switch (ui_screen) {
        case UI_MENU:
            if (i == UI_ITEM_MSG) {
                int unread = notify_unread_count();
                if (unread > 0) {
                    snprintf(built, sizeof(built), "Messages (%d) >", unread);
                    return built;
                }
            }
            if (i == UI_ITEM_QUIET) {
                /* "Quiet 00:00-08:00" or "Quiet off" — the row's name from the
                   table above, the window from the skill that owns it. The
                   longer of the two is 17 characters, which with the row's
                   marker measures 218px of font 4 against the 296px
                   ui_draw_row() has — measured against TFT_eSPI's own width
                   table, like every other column here, and pinned by
                   tools/test_quiet.sh at the hours' end. */
                char win[16];
                ring_quiet_hours(ring_night_from, ring_night_to, win, sizeof(win));
                snprintf(built, sizeof(built), "%s %s", ui_items[i], win);
                return built;
            }
            if (i == UI_ITEM_BACKLIGHT) {
                /* "Backlight day" for one of the four the menu offers, or
                   "Backlight step 13" for a level only the endpoint can set —
                   the row never rounds one into the other. The longest is the
                   step form, 210px of font 4 with the row's marker against the
                   296px ui_draw_row() has, measured against TFT_eSPI's own
                   width table like every other column here and pinned by
                   tools/test_backlight.sh at the label's end. */
                char level[BL_LABEL_MAX];
                bl_level_label(bl_wanted, level, sizeof(level));
                snprintf(built, sizeof(built), "%s %s", ui_items[i], level);
                return built;
            }
            if (i == UI_ITEM_DIM) {
                /* "Auto-dim on" or "Auto-dim off" — the row's name from the
                   table above, the state from the skill that owns it, exactly
                   as the two rows before it are built. "Auto-dim off" is the
                   longer of the two states at twelve characters against the
                   Backlight row's seventeen, so it needs no measurement of its
                   own: the row it sits under already cleared the width with
                   five characters to spare. */
                snprintf(built, sizeof(built), "%s %s", ui_items[i], bl_idle_word());
                return built;
            }
            return ui_items[i];
        case UI_TVMENU: return ui_tv_items[i];
        case UI_BRAND:  return (i < ir_code_count) ? ir_codes[i].brand : "Back";
    }
    return "";
}

/* List: the marker is part of the string, so a moved selection changes the
   text of exactly two rows and only those two are repainted. A list longer
   than the panel scrolls a window over it, and the window moves only when the
   selection would otherwise leave it — which keeps the same two-row repaint
   for every step that stays inside it. */
static void ui_draw_list() {
    int count = ui_list_count();

