Awis13/seed/seeds/esp32-tembed/src/ui.h
    ui_window(count, UI_MENU_ROWS);

    if (ui_sel == ui_sel_drawn && !display_force) return;

    for (int r = 0; r < UI_MENU_ROWS; r++) {
        int i = ui_first + r;
        char line[40];
        if (i < count) {
            snprintf(line, sizeof(line), "%s %s",
                     i == ui_sel ? ">" : " ", ui_list_label(i));
        } else {
            line[0] = '\0';  /* a short list leaves the rest of the panel blank */
        }
        ui_draw_row(r, line, UI_MENU_Y0 + r * UI_MENU_DY, 4,
                    i == ui_sel ? COL_ACCENT : COL_DIM);
    }

    /* Only a scrolling list says where in itself you are, and it goes in the
       header bar, black on amber like everything else up there. */
    if (count > UI_MENU_ROWS) {
        char pos[16];
        snprintf(pos, sizeof(pos), "%d/%d", ui_sel + 1, count);
        draw_field(ui_row[UI_ROW_COUNT - 1], sizeof(ui_row[0]), pos,
                   tft.width() - 8, HDR_Y, 2, COL_BG, TR_DATUM, 60, COL_ACCENT);
    }

    ui_sel_drawn = ui_sel;
    display_force = false;
}

/*
 * The message list. Three columns on a fixed grid, a solid inverse bar for the
 * selection, and a Back row after the messages.
 *
 * Unlike the other lists this one has to repaint without input, because the
 * age column moves on its own. The split is: the bars and the cells are forced
 * whenever the selection or the window moved (a solid bar inverts the ground
 * under text draw_field would otherwise consider unchanged), and on every
 * other pass the cache decides — which in practice means the ages, once a
 * minute, and nothing else.
 */
static void ui_draw_msglist() {
    int items = notify_count();
    int count = items + 1;  /* messages, then Back */
    ui_window(count, MSG_ROWS);

    bool relayout = display_force || ui_sel != ui_sel_drawn ||
                    ui_first != ui_first_drawn;
    if (relayout) {
        for (int r = 0; r < MSG_ROWS; r++) {
            int32_t y = MSG_ROW_Y0 + r * MSG_ROW_DY;
            tft.fillRect(MSG_BAR_X, y - MSG_BAR_UP, MSG_BAR_W, MSG_BAR_H,
                         (ui_first + r == ui_sel) ? COL_ACCENT : COL_BG);
        }
        display_force = true;  /* every cell is now on a ground it did not have */
    }

    for (int r = 0; r < MSG_ROWS; r++) {
        int i = ui_first + r;
        int32_t y = MSG_ROW_Y0 + r * MSG_ROW_DY;
        bool sel = (i == ui_sel);
        uint16_t bg = sel ? COL_ACCENT : COL_BG;
        /* Sized from the cache they end up in, so the pixel budget stays the
           only thing that decides where a string is cut. */
        char src[MSG_CELL_LEN], title[MSG_CELL_LEN], age[MSG_CELL_LEN];
        bool unread = false;

        src[0] = title[0] = age[0] = '\0';
        if (i == items) {
            snprintf(src, sizeof(src), "BACK");
        } else if (i < items) {
            NotifyView v;
            if (notify_view(i, v)) {
                unread = v.unread;
                /* An unread critical is the one thing that has to be findable
                   without reading the rows, and a leading mark does it without
                   spending a fourth colour on the screen. */
                char caps[NOTIFY_SOURCE_LEN + 4];
                if (v.level == NOTIFY_CRIT && v.unread) {
                    caps[0] = '!';
                    caps[1] = ' ';
                    ui_caps(caps + 2, sizeof(caps) - 2, v.source);
                } else {
                    ui_caps(caps, sizeof(caps), v.source);
                }
                ui_ellipsis(src, sizeof(src), caps, 2, MSG_SRC_W);
                ui_ellipsis(title, sizeof(title), v.title, 2, MSG_TITLE_W);
                notify_age_str(v.age_s, age, sizeof(age));
            }
        }

        /* Black on the bar; off it, unread messages are primary and read ones
           have already had their turn. */
        uint16_t c_pri = sel ? COL_BG : (unread ? COL_TIME : COL_DIM);
        uint16_t c_sec = sel ? COL_BG : COL_DIM;
        draw_field(ui_msg_cell[r][0], sizeof(ui_msg_cell[r][0]), src,
                   MSG_SRC_X, y, 2, c_sec, TL_DATUM, MSG_SRC_W, bg);
        draw_field(ui_msg_cell[r][1], sizeof(ui_msg_cell[r][1]), title,
                   MSG_TITLE_X, y, 2, c_pri, TL_DATUM, MSG_TITLE_W, bg);
        draw_field(ui_msg_cell[r][2], sizeof(ui_msg_cell[r][2]), age,
                   MSG_AGE_R, y, 2, c_sec, TR_DATUM, MSG_AGE_W, bg);
    }

    /* An empty queue says so instead of showing a screen with one Back row on
       it. Drawn after the loop, which has just blanked the row it sits on. */
    draw_field(ui_row[0], sizeof(ui_row[0]), items == 0 ? "NO MESSAGES" : "",
               tft.width() / 2, MSG_ROW_Y0 + MSG_ROW_DY, 2, COL_DIM,
               TC_DATUM, 200);

    ui_draw_msg_counter(ui_sel < items ? ui_sel + 1 : items, items);

    ui_sel_drawn = ui_sel;
    ui_first_drawn = ui_first;
    display_force = false;
}

/*
 * One message as tinted glass.
 *
 * The fill is the level colour blended onto black at about a tenth and the
 * border at about four tenths — real compositing through alphaBlend(), so the
 * card sits over the ground rather than replacing it. The 3px bar down the
 * left edge is the level colour at full strength and is the only saturated
 * thing on the screen.
 *
 * During the fade the whole block is repainted, because the card is also
 * moving; once settled nothing repaints but the age, and that goes through
 * draw_field against the tint rather than against black.
 */
static void ui_draw_card() {
    NotifyView v;
    int idx = 0, total = 0;
    /* Entry, position and depth of the stack in one acquisition: an arrival
       between two of them would draw one card's text under another card's
       counter. Gone — expired or evicted while it was on screen — is the false
       return; ui_poll() leaves for the list on this same pass, so there is
       nothing to draw. */
    if (!notify_view_by_id(ui_msg_id, v, &idx, &total)) return;

    uint16_t level = ui_level_color(v.level);

    bool fading = (ui_card_fade < MSG_FADE_STEPS);
    uint8_t step = fading ? (uint8_t)(ui_card_fade + 1) : (uint8_t)MSG_FADE_STEPS;
    int32_t x = MSG_CARD_X;
    int32_t y = MSG_CARD_Y + (MSG_FADE_STEPS - step) * MSG_CARD_PEEK;

    /* Everything the card draws ramps together, so the whole thing arrives as
       one object instead of a border appearing before its contents. */
    uint16_t tint   = tft.alphaBlend((uint8_t)(MSG_TINT_A * step / MSG_FADE_STEPS), level, COL_BG);
    uint16_t edge   = tft.alphaBlend((uint8_t)(MSG_BORDER_A * step / MSG_FADE_STEPS), level, COL_BG);
    uint16_t accent = tft.alphaBlend((uint8_t)(255 * step / MSG_FADE_STEPS), level, COL_BG);
    uint16_t c_pri  = tft.alphaBlend((uint8_t)(255 * step / MSG_FADE_STEPS), COL_TIME, tint);
    uint16_t c_sec  = tft.alphaBlend((uint8_t)(255 * step / MSG_FADE_STEPS), COL_DIM, tint);

