Awis13/seed/seeds/esp32-tembed/src/ui.h
    switch (item) {
        case UI_ITEM_MSG:
            ui_enter_list(UI_MSGLIST, 0);
            break;
        case UI_ITEM_QUIET:
            /* The one row that acts without leaving the menu: the answer is the
               row's own label, which now says the other thing. A screen of its
               own would be a screen with one line on it.

               display_force, because ui_draw_list() returns early when the
               selection has not moved — and it has not: what changed is a
               string the cache still holds the old copy of. */
            ring_quiet_toggle();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_BACKLIGHT:
            /* Acts without leaving the menu, exactly as Quiet does, and for the
               same reason: the answer is the row's own label, and a screen with
               one line on it would be a worse way to say it. The level is only
               recorded here — the pulse train that carries it out belongs to
               backlight_poll() on the next pass, so the redraw below happens
               while the panel is still at the old brightness and the new one
               arrives a few milliseconds later. That is the right order:
               brightness changing after the row that announced it reads as the
               row causing it. */
            backlight_menu_click();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_DIM:
            /* The third row that acts in place, for the third time the same
               reason: two states, no arguments, and the answer is the row's
               own label — which is why display_force is needed here as it is
               for Quiet, since ui_draw_list() returns early on a selection
               that has not moved. The brightness itself does not change on
               this pass: the click has just stamped ui_last_input, so the
               policy is handing the level back either way, and the switch
               only decides what happens once the dim threshold passes. */
            backlight_idle_toggle();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_TVBGONE:
            ui_enter_list(UI_TVMENU, UI_TV_ALL);
            break;
        case UI_ITEM_AP:
            /* Same entry point as the hold gesture, and time-boxed the same
               way. Raising it from the menu is the reliable route in. */
            if (!ap_active) ap_start(true);
            ui_enter(UI_AP);
            break;
        case UI_ITEM_INFO:
            ui_enter(UI_INFO);
            break;
        default:
            ui_enter(UI_CLOCK);
            break;
    }
}

/* One level up, landing on the item that leads back down. */
static void ui_back() {
    switch (ui_screen) {
        case UI_BRAND:   ui_enter_list(UI_TVMENU, UI_TV_BRAND);   break;
        case UI_TVMENU:  ui_enter_list(UI_MENU, UI_ITEM_TVBGONE); break;
        case UI_MSGLIST: ui_enter_list(UI_MENU, UI_ITEM_MSG);     break;
        default:         ui_enter(UI_CLOCK);                      break;
    }
}

static void ui_init() {
    /* GPIO0 is a strapping pin: it is only ever read, never driven. */
    pinMode(PIN_ENC_KEY, INPUT_PULLUP);
    /* Pull-ups before attaching: the library defaults to pull-DOWN, which
       leaves both channels floating against the encoder's common ground and
       makes the count wander with no error of any kind. */
    ESP32Encoder::useInternalWeakPullResistors = puType::up;
    /* Direction belongs to UI_ENCODER_DIRECTION, not to the pin order here. */
    ui_encoder.attachFullQuad(PIN_ENC_A, PIN_ENC_B);
    /* Hardware glitch filter, in APB (80MHz) cycles, 10 bits wide. attach()
       leaves it at 250 (~3.1us); 1023 is the register maximum and about
       12.8us, far below the shortest edge a hand can produce and well above
       contact bounce. The quadrature channels get this instead of a software
       time filter, which would drop real detents during a fast spin. */
    ui_encoder.setFilter(1023);
    ui_encoder.clearCount();
    ui_encoder_reset();
    /* A boot is input: the device came up because somebody pressed something or
       plugged it in, so the idle clock starts here rather than at zero. */
    ui_note_input();
}

/*
 * The two screens that must not be taken away from whoever is watching them.
 *
 * They are predicates rather than two locals inside ui_poll() because there is
 * a second consumer: the backlight's idle policy exempts exactly these, and it
 * has to exempt the SAME ones. A blast dimmed to nothing halfway through, or a
 * level meter that fades while a finger is still on the key, would be the same
 * defect the screen timeout was already written to avoid — and two copies of
 * this pair, thirty lines apart, is how they would come to disagree.
 *
 * A blast counts only while it is on the panel: one started over HTTP while a
 * menu is up is not live output the person in front of the device is watching,
 * and there is nothing on screen for the exemption to protect.
 */
static bool ui_watching_blast() { return ui_screen == UI_BLAST && ir_busy(); }

/* The recording screen is exempt outright rather than only while it records: a
   hold can outlast fifteen seconds of "no input" — holding a key is not input
   to the click state machine — and its own exit is deterministic, so neither
   the timeout nor the dimming has anything to add and both could only fire
   mid-sentence. */
static bool ui_watching_rec() { return ui_screen == UI_REC; }

/*
 * The progress bar, which is live output too — but only to the backlight, and
 * that asymmetry is the whole reason it is a third predicate rather than a
 * third case in the pair above.
 *
 * The screen timeout may fire under a bar and cost nothing: what it does is
 * return to the clock face, and the clock face is where the bar is drawn. Going
 * dark is not the same act. A job pushed with POST /progress — a backup script,
 * a long build, anything holding a percentage up on somebody's desk — has
 * nothing to do with the knob, so nothing stamps ui_last_input for it and the
 * panel it is drawn on would otherwise go out two minutes in.
 *
 * On the clock face only, for the same reason a blast counts only while it is
 * on the panel: a bar nobody can see is not output being protected. And bounded
 * without any help from here, because a job carries a deadline of its own — the
 * bar clears itself and the panel goes back to blanking on schedule.
 */
static bool ui_watching_progress() {
    return ui_screen == UI_CLOCK && progress_current(NULL);
}

