Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * Hand the backlight policy the idle clock. Called from loop(), once a pass,
 * immediately above backlight_poll().
 *
 * NOT from inside ui_poll(), and the reason is worth stating because the
 * opposite looks obviously right: ui_poll() returns early from most paths, and
 * from the clock face it returns UNCONDITIONALLY — `case UI_CLOCK` has nothing
 * to time out to, so it answers the click and leaves. The clock face is where
 * this device spends its life, so a brightness decision made at the bottom of
 * ui_poll() would be a brightness decision that almost never runs. What IS
 * shared with the screen timeout is everything that matters: the one timestamp,
 * and the two exemptions it also has.
 *
 * That unconditional return is also why the thresholds mean exactly what they
 * say FROM THE CLOCK FACE. Elsewhere they are later, and by a knowable amount:
 * ui_enter() stamps the timestamp, so the automatic return to the clock at
 * UI_IDLE_MS restarts the dim clock once. Input on a menu therefore dims at
 * UI_IDLE_MS + BL_IDLE_DIM_MS and blanks at UI_IDLE_MS + BL_IDLE_OFF_MS — one
 * restart and not a repeating one, because from the clock face there is no
 * further timeout to stamp anything. Worth knowing before timing the device
 * with a stopwatch and concluding the thresholds are wrong.
 *
 * The subtraction is here, in the one place that owns ui_last_input, and it is
 * the unsigned form that survives the 49-day wrap of millis(). bl_idle_level()
 * is handed the elapsed time and no clocks at all.
 */
static void ui_backlight_idle() {
    /* The message card needs no exemption of its own, and this is why. A card
       is returned to the clock face after UI_IDLE_MS whether it was read or
       not, so with the dim threshold strictly longer than that, a card is
       never on the panel when the first dimming happens — there is no moment
       at which a notification could fade out from under somebody reading it.
       That is arithmetic between two constants in two files, so it is checked
       here rather than trusted: shortening either one below the other stops
       the build instead of quietly costing somebody a message. */
    static_assert(BL_IDLE_DIM_MS > UI_IDLE_MS,
                  "the backlight must not dim while a message card can still "
                  "be on the panel: BL_IDLE_DIM_MS must exceed UI_IDLE_MS");
    /* The fourth fact is not about a screen at all: an unread critical never
       expires, and blanking the panel would take away the breathing hairline
       that is the only sign of one left once the ring's night window has
       silenced the ring. skills/backlight.cpp turns that into a floor, not a
       wake-up. */
    BacklightPanel panel;
    panel.blasting = ui_watching_blast();
    panel.recording = ui_watching_rec();
    panel.on_bar = ui_watching_progress();
    panel.crit_unread = notify_crit_unread();
    backlight_idle(millis() - ui_last_input, panel);
}

/* Called every loop() pass. Nothing here blocks and nothing here draws unless
   something actually changed. */
static void ui_poll() {
    int steps = ui_encoder_steps();
    ui_button_poll(ui_enc_key);
    ui_button_poll(ui_user_key);

    /* The encoder key's long hold belongs to the recording gesture in
       mic_key_poll(), so only a short press counts as a click here. Without
       this the release that ends a recording would ALSO open the menu from the
       clock, on top of stopping the take — the same trap the user key was
       already guarded against below, and for the same reason. */
    bool click = ui_enc_key.click && ui_enc_key.held_ms < MIC_HOLD_MS;
    /* The user key's long hold belongs to the AP gesture in ap_key_poll(), so
       only a short press counts as "back" here. */
    bool back = ui_user_key.click && ui_user_key.held_ms < AP_KEY_HOLD_MS;

    /*
     * A press on a panel the policy has blanked wakes it and does nothing else.
     *
     * Before there was a dark state every press was deliberate, because there
     * was always something on the screen to press AT. Now the first press is
     * usually somebody wanting to see the time — and on the clock face a click
     * opens the menu, so without this they get the menu instead. That is how
     * every phone and every watch behaves and the opposite is a surprise every
     * single time.
     *
     * Only while it was BLANK. A press on a merely dimmed panel is a press on a
     * screen its owner can read, and swallowing that would be taking away a
     * click they meant. backlight_blanked() answers the narrow question — dark
     * because of the policy, which a press undoes — and not "dark", which on a
     * device somebody set to level 0 by hand a press does not.
     *
     * The two long-hold gestures are untouched and must stay so: a hold is not
     * a glance. Both are polled off the pin elsewhere in loop(), and both are
     * already excluded from `click` and `back` by the guards above, so a
     * three-second hold on the user key still raises the setup AP from a dark
     * panel and a hold on the encoder still starts a recording.
     */
    bool woke = backlight_blanked() && (steps != 0 || click || back);

    if (steps != 0 || click || back) ui_note_input();

    if (woke) {
        steps = 0;
        click = false;
        back = false;
    }

    /* The knob's own feedback on the ring, which outranks whatever the ring was
       saying by itself: a hand is on the control. The screen and the ring get
       the same detents, and neither is told what the other did with them.
       Below the wake, deliberately: the detent that brings the panel back is
       spent on bringing it back, and lighting an arc for a turn that moved
       nothing would be the same surprise in a different colour. */
    ring_knob(steps);

    /*
     * A recording takes the panel, from any screen and without being asked.
     *
     * It outranks everything else here for the same reason a running blast
     * does: it is live output, and there is no point in a level meter you
     * cannot see. It is also the only feedback that says the hold registered
     * at all — mic.cpp decides that on its own, off the pin level, and this is
     * how the UI finds out. Nothing below can take the screen back while a
     * take runs: the arrival branch only fires on the clock face, and the case
     * for UI_REC ignores input entirely.
     */
    if (mic_is_recording() && ui_screen != UI_REC) {
        ui_rec_done_at = 0;
        ui_enter(UI_REC);
        return;
    }

