Awis13/seed/seeds/esp32-tembed/src/ui.h
    /*
     * A message that arrives while the device is sitting on its clock puts
     * itself in front — that is the whole job. It does not take a screen away
     * from somebody using one: the unread badge and the Messages list are how
     * it gets noticed then. Either way the flag is consumed on the pass it
     * arrives, so a card can never appear fifteen seconds later when the idle
     * timer happens to land. And it yields to a hand already on the knob: a
     * pass carrying input is that user's pass.
     */
    if (steps == 0 && !click && !back) {
        uint32_t arrived = 0;
        if (notify_take_arrival(&arrived) && arrived != 0 &&
            ui_screen == UI_CLOCK) {
            ui_sel = 0;
            ui_first = 0;
            ui_enter_card(arrived);
            return;
        }
    }

    switch (ui_screen) {
        case UI_CLOCK:
            if (click) ui_enter_list(UI_MENU, 0);
            return;

        case UI_MENU:
        case UI_TVMENU:
        case UI_BRAND:
        case UI_MSGLIST: {
            if (back) { ui_back(); return; }
            if (steps != 0) {
                int count = ui_list_count();
                ui_sel += steps;
                /* Wrap rather than clamp: a knob with no end stops, so running
                   off one end should arrive at the other. */
                ui_sel %= count;
                if (ui_sel < 0) ui_sel += count;
                ui_draw();
            }
            if (click) { ui_activate(ui_sel); return; }
            break;
        }

        case UI_MSGCARD: {
            int idx = notify_index_of(ui_msg_id);
            /* Expired or evicted out from under the card. */
            if (idx < 0) { ui_enter_list(UI_MSGLIST, 0); return; }

            /* What the message carries is what decides what the knob does, and
               it is read on the pass that carries the input rather than kept
               across passes: a count cached at entry is a count that can no
               longer be checked against the entry being answered.
               notify_view_by_id() is the lookup ui_draw_card() draws with and
               stops at the same first id match, so the row on screen and the
               row being answered cannot be different rows. */
            NotifyView v;
            uint8_t opts = 0;
            if ((click || steps != 0) &&
                notify_view_by_id(ui_msg_id, v, NULL, NULL)) {
                opts = v.opt_count;
            }

            /* A click is "I have seen this" — or, when ui_chip_answers() says
               this one is an answer, the answer, which is stronger:
               notify_choose_id() marks it read as part of recording the choice.
               Everything else falls through to the plain acknowledgement,
               including a click on a card that asks something nobody has
               turned the knob to yet. The step by zero is the clamp, for a
               selection restored from a `chosen` the store no longer has
               options for. The user key is the same plain step up it is on
               every other screen and leaves the message unread, and its
               question unanswered, on purpose. */
            if (click) {
                if (ui_chip_answers(ui_chip_sel, opts)) {
                    notify_choose_id(ui_msg_id,
                                     (uint8_t)ui_chip_step(ui_chip_sel, 0, opts));
                } else {
                    notify_ack_id(ui_msg_id);
                }
                ui_enter_list(UI_MSGLIST, idx);
                return;
            }
            if (back) { ui_enter_list(UI_MSGLIST, idx); return; }
            if (steps != 0) {
                /* Rotation belongs to the chips only while there are chips to
                   pick. On every other message it keeps walking the stack
                   exactly as it always has, so nothing is taken away from a
                   message that asks nothing. */
                if (opts > 0) {
                    ui_chip_sel = ui_chip_step(ui_chip_sel, steps, opts);
                    ui_draw();
                    break;
                }
                int count = notify_count();
                if (count > 0) {
                    int n = (idx + steps) % count;
                    if (n < 0) n += count;
                    /* Its own name: `v` above is the card on screen, this is
                       the neighbour being stepped to, and they are two
                       different messages. */
                    NotifyView next;
                    /* Re-fade on the way in, so moving through the stack reads
                       as one card replacing another rather than as text
                       changing inside a frame that never moved. */
                    if (notify_view(n, next)) { ui_sel = n; ui_enter_card(next.id); return; }
                }
            }
            break;
        }

        case UI_BLAST: {
            /* A click stops the job; the screen stays until it has actually
               wound down, then shows how it ended for a moment. Either way it
               goes back to the list the job was started from. */
            if (click) ir_stop_job();
            if (back) {
                ir_stop_job();
                ui_enter_list(ui_blast_back, ui_blast_back_sel);
                return;
            }
            if (ir_busy()) {
                ui_blast_done_at = 0;
            } else if (ui_blast_done_at == 0) {
                ui_blast_done_at = millis();
            } else if (millis() - ui_blast_done_at >= UI_RESULT_MS) {
                ui_enter_list(ui_blast_back, ui_blast_back_sel);
                return;
            }
            break;
        }

        case UI_REC:
            /* Input is not how this screen ends. The release of the very key
               that started the take is what stops it, and mic_key_poll() has
               already acted on that release by the time ui_poll() runs — so
               there is nothing here to react to, and reacting would mean
               reacting twice. The click that release produced was suppressed
               above by the MIC_HOLD_MS guard in any case. */
            if (mic_is_recording()) {
                ui_rec_done_at = 0;
                break;
            }
            /* The take is over: hold the result up long enough to read the
               peak, then go home. Signed, and against a fresh reading, as
               everything in this firmware that subtracts clocks now is. */
            if (ui_rec_done_at == 0) {
                ui_rec_done_at = millis();
            } else if ((long)(millis() - ui_rec_done_at) >= (long)UI_REC_RESULT_MS) {
                ui_enter(UI_CLOCK);
                return;
            }
            break;

        case UI_AP:
        case UI_INFO:
            if (click || back) {
                ui_enter_list(UI_MENU,
                              ui_screen == UI_AP ? UI_ITEM_AP : UI_ITEM_INFO);
                return;
            }
            break;
    }

    /* Live output must not be timed out from under the user; everything else
       falls back to the clock. Both exemptions are stated once, above, and the
       backlight's idle policy reads the same two. */
    if (!ui_watching_blast() && !ui_watching_rec() &&
        millis() - ui_last_input >= UI_IDLE_MS) {
        ui_enter(UI_CLOCK);
        return;
    }

    /* The card runs at the fade rate only while it is actually fading — three
       frames — and drops back to the ordinary tick the moment it has settled. */
    unsigned long interval =
        (ui_screen == UI_MSGCARD && ui_card_fade < MSG_FADE_STEPS)
            ? MSG_FADE_MS : UI_TICK_MS;

    if (millis() - ui_last_draw >= interval) {
        ui_last_draw = millis();
        if (!ui_input_driven(ui_screen)) ui_draw();
    }
}
